---
kind: method
id: M:Autodesk.Revit.DB.Lighting.RectangleLightShape.#ctor
source: html/50b10199-177a-28cb-994d-515703bb1007.htm
---
# Autodesk.Revit.DB.Lighting.RectangleLightShape.#ctor Method

Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.

## Syntax (C#)
```csharp
public RectangleLightShape()
```